# ì—´ ê·¸ë£¹ì„ ë…¹ì´ê¸°
- (3)ì—ì„œ ë‘ ê·¸ë£¹ì˜ ì—´ì„ ë…¹ì´ê¸° ìœ„í•´ì„œëŠ” meltë¥¼ ë‘ ë²ˆ ì‹¤í–‰í•œ ë’¤, í•˜ë‚˜ì˜ ë°ì´í„°í”„ë ˆì„ìœ¼ë¡œ ë³‘í•©í•´ì•¼ í–ˆìŒ
- wide_to_long í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•´ë„ ë™ì¼í•œ ê²°ê³¼ë¥¼ ì–»ì„ ìˆ˜ ìˆìŒ ğŸ‘‰ ê¸°ëŠ¥ì´ ë§ì§€ë§Œ ì‚¬ìš©ë²•ì´ ì¢€ ë” ë³µì¡
---
- ì—´ ê·¸ë£¹ì—ì„œ ë°˜ë³µë˜ëŠ” ë¶€ë¶„(weeksworked, colenroct ê°™ì€ ë¶€ë¶„)ì„ í•¨ìˆ˜ì— ì „ë‹¬í•˜ëŠ” ê²ƒì´ í¬ì¸íŠ¸
- ì—´ ì´ë¦„ì˜ ë’·ë¶€ë¶„(ì—°ë„)ì„ ê°’ìœ¼ë¡œ ë°”ê¿”ì„œ jë§¤ê°œë³€ìˆ˜ë¡œ ì§€ì •í•œ ì—´ì— ì±„ì›Œì¤€ë‹¤

### ë°ì´í„° : NLS ê·¼ë¬´ ì£¼ ìˆ˜ & ëŒ€í•™ ë“±ë¡ ë°ì´í„°

In [2]:
import pandas as pd

nls97= pd.read_csv('data/nls97f.csv')
nls97.set_index('personid', inplace=True)

In [3]:
# ê·¼ë¬´ ì£¼ ìˆ˜ì™€ ëŒ€í•™ë“±ë¡ ë°ì´í„° ì¼ë¶€ í™•ì¸
weeksworkedcols = ['weeksworked00', 'weeksworked01', 'weeksworked02', 'weeksworked03', 'weeksworked04']
colenrcols = ['colenroct00', 'colenroct01', 'colenroct02', 'colenroct03', 'colenroct04']

In [4]:
nls97.loc[nls97.originalid.isin([1, 2]), ['originalid'] + weeksworkedcols + colenrcols].T

personid                  135335              999406
originalid                     1                   2
weeksworked00               53.0                51.0
weeksworked01               52.0                52.0
weeksworked02                NaN                44.0
weeksworked03               42.0                45.0
weeksworked04               52.0                52.0
colenroct00    3. 4-year college   3. 4-year college
colenroct01    3. 4-year college  2. 2-year college
colenroct02    3. 4-year college   3. 4-year college
colenroct03      1. Not enrolled   3. 4-year college
colenroct04      1. Not enrolled   3. 4-year college

### ğŸ“wide_to_long í•¨ìˆ˜ ì‹¤í–‰
- stubnamesì— ë¦¬ìŠ¤íŠ¸ë¥¼ ì „ë‹¬ ->> ë³€í™˜í•˜ë ¤ëŠ” ì—´ ê·¸ë£¹ ì§€ì‹œ(ë¦¬ìŠ¤íŠ¸ì˜ ê° ì•„ì´í…œê³¼ ê°™ì€ ì´ë¦„ìœ¼ë¡œ ì‹œì‘í•˜ëŠ” ëª¨ë“  ì—´ ì„ íƒ)
- i ë§¤ê°œë³€ìˆ˜ë¡œ id ë³€ìˆ˜ ì „ë‹¬
- j ë§¤ê°œë³€ìˆ˜ë¡œ ì—´ ì´ë¦„ ë’¤ì— ë¶™ì–´ìˆë˜ "00, 01ë“±ì— ê¸°ë°˜í•œ" ì—´ ì´ë¦„(year) ì§€ì •

In [8]:
workschool = pd.wide_to_long(nls97[['originalid']+weeksworkedcols+colenrcols],
               stubnames=['weeksworked', 'colenroct'],
               i=['originalid'], j='year').reset_index()

In [10]:
workschool['year'] = workschool.year + 2000

In [13]:
workschool = workschool.sort_values(['originalid', 'year'])

In [15]:
workschool.set_index(['originalid'], inplace = True)

In [16]:
workschool.head(10)

            year  weeksworked           colenroct
originalid
1           2000         53.0   3. 4-year college
1           2001         52.0   3. 4-year college
1           2002          NaN   3. 4-year college
1           2003         42.0     1. Not enrolled
1           2004         52.0     1. Not enrolled
2           2000         51.0   3. 4-year college
2           2001         52.0  2. 2-year college
2           2002         44.0   3. 4-year college
2           2003         45.0   3. 4-year college
2           2004         52.0   3. 4-year college

### ì¶”ê°€ í•™ìŠµ
- ìœ„ì˜ ì˜ˆì‹œì—ì„œëŠ” stubnames ì—´ì˜ ë’·ë¶€ë¶„ì´ 00~04ë¡œ ë™ì¼í•˜ì§€ë§Œ í•­ìƒ ì´ë ‡ê²Œ ë˜ì–´ ìˆìœ¼ë¦¬ë¼ëŠ” ë²•ì€ ì—†ë‹¤.
- í•œìª½ ê·¸ë£¹ì—ëŠ” ë’·ë¶€ë¶„ì— ê¸€ìê°€ ë¶™ì–´ìˆê³ , ë‹¤ë¥¸ ê·¸ë£¹ì—ëŠ” ê·¸ë ‡ì§€ ì•Šë‹¤ë©´, í›„ìëŠ” ëˆ„ë½ê°’ìœ¼ë¡œ ì²˜ë¦¬ëœë‹¤.
- ì´ëŸ¬í•œ ì˜ˆë¥¼ weeksworked03ì„ ë¹¼ê³  weeksworked05ë¥¼ ì¶”ê°€í•´ì„œ í™•ì¸í•´ë³¸ë‹¤.

In [17]:
weeksworkedcols = ['weeksworked00', 'weeksworked01', 'weeksworked02', 'weeksworked04', 'weeksworked05']

In [27]:
workschool = pd.wide_to_long(nls97[['originalid']+weeksworkedcols+colenrcols],
                            stubnames=['weeksworked', 'colenroct'],
                            i=['originalid'], j='year').reset_index()

In [29]:
workschool['year'] = workschool['year']+2000

In [31]:
workschool = workschool.sort_values(['originalid', 'year'])
workschool.set_index(['originalid'], inplace = True)
workschool.head(12)

            year  weeksworked           colenroct
originalid
1           2000         53.0   3. 4-year college
1           2001         52.0   3. 4-year college
1           2002          NaN   3. 4-year college
1           2003          NaN     1. Not enrolled
1           2004         52.0     1. Not enrolled
1           2005         53.0                 NaN
2           2000         51.0   3. 4-year college
2           2001         52.0  2. 2-year college
2           2002         44.0   3. 4-year college
2           2003          NaN   3. 4-year college
2           2004         52.0   3. 4-year college
2           2005         53.0                 NaN